Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Описание: Возвращает текущий статус документа.
//
//
// Параметры:
//	СогласуемыйДокумент - ОпределяемыйТип.торо_СогласуемыеДокументы - СогласуемыйДокумент. 
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот - СтатусДокумента.
//
Функция ТекущийСтатусДокумента(СогласуемыйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусДокумента
		|ИЗ
		|	РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
		|ГДЕ
		|	торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = &СогласуемыйДокумент";
	
	Запрос.УстановитьПараметр("СогласуемыйДокумент", СогласуемыйДокумент);
	Выборка = Запрос.Выполнить().Выбрать();   	
	Выборка.Следующий();
	
	Возврат Выборка.СтатусДокумента; 
		
КонецФункции      

#КонецОбласти

#Конецесли
